from calc import Mon

TEAM = [
    Mon('イダイトウ', 'ようき', dict(hp=2, atk=32, spe=32), 'てきおうりょく', 'こだわりスカーフ',
        ['ウェーブタックル', 'おはかまいり', 'クイックターン', 'れいとうビーム'], label='Iイダイトウ'),
    Mon('ガブリアス', 'ようき', dict(hp=2, atk=32, spe=32), 'さめはだ', 'きあいのタスキ',
        ['じしん', 'げきりん', 'がんせきふうじ', 'ステルスロック'], label='Gガブリアス'),
    Mon('アシレーヌ', 'ひかえめ', dict(hp=32, defn=20, spa=14), 'げきりゅう', 'オボンのみ',
        ['うたかたのアリア', 'ムーンフォース', 'アンコール', 'アクアジェット'], label='Aアシレーヌ'),
    Mon('ヒートロトム', 'ずぶとい', dict(hp=32, defn=32, spd=2), 'ふゆう', 'たべのこし',
        ['オーバーヒート', 'ボルトチェンジ', 'おにび', 'いたみわけ'], label='Hロトム'),
    Mon('ミミッキュ', 'いじっぱり', dict(hp=1, atk=32, defn=1, spe=32), 'ばけのかわ', 'いのちのたま',
        ['じゃれつく', 'かげうち', 'つるぎのまい', 'シャドークロー'], label='Mミミッキュ'),
    Mon('メガメタグロス', 'いじっぱり', dict(hp=2, atk=32, spe=32), 'かたいツメ', 'メタグロスナイト',
        ['バレットパンチ', 'サイコファング', 'れいとうパンチ', 'じしん'], label='Kメタグロス'),
]
