from calc import Mon

TEAM = [
    Mon('メガルカリオＺ', 'おくびょう', dict(hp=2, spa=32, spe=32), 'はどうのぼうご', 'ルカリオナイトZ',
        ['わるだくみ', 'はどうだん', 'あくのはどう', 'ラスターカノン'], label='Lルカリオ'),
    Mon('ガブリアス', 'ようき', dict(hp=2, atk=32, spe=32), 'さめはだ', 'きあいのタスキ',
        ['じしん', 'げきりん', 'がんせきふうじ', 'ステルスロック'], label='Gガブリアス'),
    Mon('アシレーヌ', 'ひかえめ', dict(hp=32, defn=20, spa=14), 'げきりゅう', 'オボンのみ',
        ['うたかたのアリア', 'ムーンフォース', 'めいそう', 'アンコール'], label='Aアシレーヌ'),
    Mon('ヒートロトム', 'ずぶとい', dict(hp=32, defn=32, spd=2), 'ふゆう', 'たべのこし',
        ['オーバーヒート', 'ボルトチェンジ', 'おにび', 'いたみわけ'], label='Hロトム'),
    Mon('ミミッキュ', 'いじっぱり', dict(hp=1, atk=32, defn=1, spe=32), 'ばけのかわ', 'いのちのたま',
        ['じゃれつく', 'かげうち', 'つるぎのまい', 'シャドークロー'], label='Mミミッキュ'),
    Mon('ギャラドス', 'わんぱく', {'hp': 32, 'def': 32, 'atk': 2}, 'いかく', 'ゴツゴツメット',
        ['たきのぼり', 'ゆきなだれ', 'でんじは', 'ちょうはつ'], label='Yギャラドス'),
]
